app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("name", "artist", "length", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Welcome to New York"], ["artist", "Taylor Swift"], ["length", "3:32"], ["created_at", "2020-11-16 16:37:26.402760"], ["updated_at", "2020-11-16 16:37:26.402760"]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "length" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["length", "3:30"], ["updated_at", "2020-11-16 16:38:11.998453"], ["id", 6]]